#+TITLE: Ruby's reference
#+DATE: <2024-06-11 mar>

|------+-----------------------------------------------------------|
| docs | https://docs.ruby-lang.org/en/                            |
| home | https://www.ruby-lang.org/en/                             |
| wiki | https://en.wikipedia.org/wiki/Ruby_on_Rails               |
| wiki | https://en.wikipedia.org/wiki/Ruby_(programming_language) |
| wiki | https://en.wikibooks.org/wiki/Ruby_Programming            |
| impl | https://github.com/oracle/truffleruby                     |
| impl | https://www.jruby.org                                     |
| impl | http://www.rubymotion.com/                                |
|------+-----------------------------------------------------------|

- Author: Yukihiro Matsumoto (matz)
- 1995-
- Written in C
- Author wanted an OO language.
  Didn't like Python, because it wasn't true OO.

- #!/usr/bin/env ruby

- challenges
  - https://www.rubykoans.com/

* snippets

#+begin_src ruby :exports both
  `xrandr`.scan(/current (\d+) x (\d+)/)
    .flatten
    .map(&:to_i)
#+end_src

#+RESULTS:
| 1600 | 900 |

#+NAME: split into words
#+begin_src ruby :exports both
  "FOO Bar Foo".downcase.scan(/[\w']+/)
#+end_src

#+RESULTS: split into words
| foo | bar | foo |

